{
  "basics": {
    "name": "Hamid Taheri",
    "label": "Scientist",
    "image": "",
    "email": "taheri.hamiid@gmail.com",
    "url": "https://hamidthri.github.io",
    "summary": "A programmer at 42 Heilbronn with a Master’s degree in Electrical Engineering, specializing in AI and control systems. Proficient in C, C++, Python, and PyTorch, he is passionate about deep learning and computer vision, excelling in developing innovative AI solutions.",
    "location": {
      "city": "Heilbronn",
      "countryCode": "Germany",
      "state": "Baden-Württemberg"
    },
    "profiles": [
      {
        "network": "linkedin",
        "username": "Hamid Taheri",
        "url": "https://www.linkedin.com/in/hamiid-taheri"
      }
    ]
  },
  "education": [
    {
      "institution": "Germany, 42 Heilbronn",
      "location": "Germany",
      "area": "<strong>Computer Science</strong>",
      "studyType": "Ongoing",
      "startDate": "2023-01-01",
      "endDate": "",
      "courses": [
        "Focused on mastering C, C++, Shell, and Docker through dynamic, project-based learning.",
        "Successfully completed a variety of programming tasks, including game development, graphical projects, Docker containerization, and web server implementation, demonstrating robust problem-solving abilities and creativity."
      ]
    },
    {
      "institution": "Tehran, K. N. Toosi University of Technology",
      "location": "Tehran, Iran",
      "area": "Electrical Engineering, Control",
      "studyType": "M.Sc.",
      "startDate": "2019-10-01",
      "endDate": "2022-10-01",
      "score": "16.99/20 or 3.61/4",
      "courses": [
        "Supervisor: Prof. Mohammad Teshnehlab",
        "Thesis Title: Continuous Control of Nonholonomic Mobile Robots Navigation Using Deep Reinforcement Learning Algorithm (PPO, DDPG)"
      ]
    },
    {
      "institution": "Isfahan, University of Isfahan",
      "location": "Isfahan, Iran",
      "area": "Electrical Engineering, Control",
      "studyType": "B.Sc.",
      "startDate": "2014-10-01",
      "endDate": "2018-10-01",
      "score": "16.83/20 or 3.35/4",
      "courses": [
        "Supervisor: Dr. Mehdi Edrisi",
        "Thesis Title: Mentor Robot Position Control Using Forward Kinematic Concept and Mobile Sensors Data"
      ]
    }
  ],
  "skills": [
    {
      "name": "Programming Languages and DevOps Tools",
      "level": "Advanced",
      "keywords": [
        "Python",
        "Git",
        "Docker",
        "MATLAB",
        "PyTorch",
        "ROS",
        "C/C++",
        "Problem Solving"
      ]
    },
    {
      "name": "Engineering Software",
      "level": "Proficient",
      "keywords": [
        "CodeVision",
        "Psim",
        "LabView",
        "PVSyst",
        "Proteus",
        "PSpice"
      ]
    },
    {
      "name": "Specializations",
      "level": "Expert",
      "keywords": [
        "Computer Vision",
        "Object Detection",
        "Reinforcement Learning",
        "Large Language Models (LLM)",
        "Deep Learning (CNN, RNN, Transformer)",
        "Autonomous Vehicles",
        "Diffusion Models"
      ]
    }
  ],
  "publications": [
    {
      "name": "Deep Reinforcement Learning with Enhanced PPO for Safe Mobile Robot Navigation",
      "releaseDate": "2024-05-01",
      "url": "https://arxiv.org/abs/2405.16266",
      "summary": ""
    },
    {
      "name": "COVID-19 Detection Based on Blood Test Parameters using Various Artificial Intelligence Methods",
      "releaseDate": "2024-04-01",
      "url": "https://arxiv.org/abs/2404.02348",
      "summary": ""
    }
  ],
  "experience": [
    {
      "name": "",
      "position": "",
      "summary": "",
      "highlights": [
        "Focused on mastering C, C++, Shell, and Docker through dynamic, project-based learning, while successfully completing a variety of programming tasks such as game development, graphical projects, and web server implementation.",
        "Achieved top rankings in virtual simulations with a running time of 15.52 seconds in the re:Invent 2018 Track, and led my team in real-world evaluation through participation in RL competitions sponsored by Audi and XL2.",
        "Developed AI models to achieve diagnostic accuracies of 94.09% for blood test samples and 91.1% for radiographic images in distinguishing COVID-19 patients.",
        "Implemented a quantum leader election protocol utilizing the coin-flipping principle from quantum computing, specifically designed for competitive environments like blockchain competitions.",
        "Applied expertise in AI projects and control engineering to collaboratively solve practical problems within interdisciplinary teams during my master's program at the Intelligence Systems Lab (ISLab)."
      ]
    }
  ],
  "projects": [
    {
      "name": "Deep Reinforcement Learning",
      "summary": "Enhanced robot navigation safety using Deep Reinforcement Learning (PPO, DDPG) and ROS, leveraging LiDAR data. Achieved high speed and accuracy in a simple environment by implementing novel network structures.",
      "startDate": "2021",
      "endDate": "2022",
      "url": "https://github.com/hamidthri/navbot_ppo"
    },
    {
      "name": "Control Engineering",
      "highlights": [
        "Conducted Observability/Controllability Analysis and designed a PID controller for an Electric Diesel Locomotive system, achieving a significant improvement in control efficiency."
      ],
      "startDate": "",
      "endDate": "",
      "url": ""
    },
    {
      "name": "Convolution Neural Networks",
      "highlights": [
        "Implemented object detection using YOLOv3 with non-max suppression on the COCO dataset, achieving an average precision of 90%.",
        "COVID-19 Diagnosis from blood test samples and X-RAY using CNNs."
      ],
      "startDate": "",
      "endDate": "",
      "url": "https://github.com/hamidthri/YoloV3_from_scratch"
    },
    {
      "name": "MLP Neural Networks",
      "highlights": [
        "Stability Analysis of Deep Learning Architectures for Perception and Control Systems in Car Suspension.",
        "Developed fault detection in rotating machinery using Deep Stack Auto-encoder, achieving 99% accuracy and a 98% F1 score. Developed a versatile MLP library using numpy supporting regression and binary classification tasks with a focus on reducing computations."
      ],
      "startDate": "",
      "endDate": "",
      "url": "https://github.com/hamidthri/mlp_custom"
    },
    {
      "name": "Large Language Models (LLMs)",
      "highlights": [
        "Investigated the impact of prompt engineering on summarization using the DialogSum dataset and FLAN-T5.",
        "Evaluated a scripted dialogue summarization model using Hugging Face datasets and Transformers, demonstrating expertise in NLP."
      ],
      "startDate": "2023",
      "endDate": "",
      "url": "https://github.com/hamidthri/Generative_AI"
    },
    {
      "name": "C, C++, and Shell",
      "highlights": [
        "Implemented Push Swap project, sorting integers efficiently using limited stack operations.",
        "Developed Minishell, a Unix shell clone in C, with core functionalities including command parsing, execution, environment management, I/O redirection, pipelines, and signal handling.",
        "Developed MiniRT, a ray tracing program for rendering computer-generated images."
      ],
      "startDate": "2023",
      "endDate": "Present"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Persian",
      "fluency": "Native"
    },
    {
      "language": "German",
      "fluency": "B1"
    }
  ]
}
